<details><summary>Full Terraform Plan</summary> \n \n \`\`\`terraform \n[command]/Users/benny/github-team/actions-runner/_work/_temp/35a1f5a1-18d8-46fc-8f8d-b09961638e18/terraform-bin show -no-color tfplan.out

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_iam_policy_document.alb will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "alb" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks.data.aws_iam_policy_document.autoscaler will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "autoscaler" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks.data.aws_subnet.private will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = (known after apply)
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + available_ip_address_count                     = (known after apply)
      + cidr_block                                     = (known after apply)
      + customer_owned_ipv4_pool                       = (known after apply)
      + default_for_az                                 = (known after apply)
      + enable_dns64                                   = (known after apply)
      + enable_resource_name_dns_a_record_on_launch    = (known after apply)
      + enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = (known after apply)
      + map_customer_owned_ip_on_launch                = (known after apply)
      + map_public_ip_on_launch                        = (known after apply)
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + state                                          = (known after apply)
      + tags                                           = (known after apply)
      + vpc_id                                         = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.eks.data.tls_certificate.self will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "self" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_eks_cluster.self will be created
  + resource "aws_eks_cluster" "self" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "ghest-dev"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "Development"
          + "Project"     = "GHESTDev"
        }
      + tags_all              = {
          + "Environment" = "Development"
          + "Project"     = "GHESTDev"
        }
      + version               = (known after apply)

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = false
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.self[0] will be created
  + resource "aws_eks_node_group" "self" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "ghest-dev"
      + disk_size              = 100
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + node_group_name        = "ghest-dev-workers"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = (known after apply)
          + min_size     = 3
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_iam_openid_connect_provider.self will be created
  + resource "aws_iam_openid_connect_provider" "self" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.alb will be created
  + resource "aws_iam_policy" "alb" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "GHESTDevAWSLoadBalancerControllerIAMPolicy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.eks.aws_iam_policy.autoscaler will be created
  + resource "aws_iam_policy" "autoscaler" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "GHESTDevEKSClusterAutoscalerIAMPolicy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:DescribeTags",
                          + "ec2:DescribeLaunchTemplateVersions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.eks.aws_iam_role.alb will be created
  + resource "aws_iam_role" "alb" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GHESTDevALBIngressControllerServiceAccountRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.autoscaler will be created
  + resource "aws_iam_role" "autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GHESTDevEKSClusterAutoscalerServiceAccountRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GHESTDevEKSClusterRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.node_group will be created
  + resource "aws_iam_role" "node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GHESTDevManagedNodeGroupRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "GHESTDevManagedNodeGroupRole"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "GHESTDevManagedNodeGroupRole"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "GHESTDevManagedNodeGroupRole"
    }

  # module.eks.aws_iam_role_policy_attachment.alb will be created
  + resource "aws_iam_role_policy_attachment" "alb" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.autoscaler will be created
  + resource "aws_iam_role_policy_attachment" "autoscaler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "GHESTDevEKSClusterRole"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_service_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_service_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "GHESTDevEKSClusterRole"
    }

  # module.network.aws_default_route_table.public will be created
  + resource "aws_default_route_table" "public" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags                   = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-public-routes"
          + "Project"     = "GHESTDev"
        }
      + tags_all               = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-public-routes"
          + "Project"     = "GHESTDev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_eip.self[0] will be created
  + resource "aws_eip" "self" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.network.aws_eip.self[1] will be created
  + resource "aws_eip" "self" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.network.aws_eip.self[2] will be created
  + resource "aws_eip" "self" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.network.aws_internet_gateway.self will be created
  + resource "aws_internet_gateway" "self" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-main"
          + "Project"     = "GHESTDev"
        }
      + tags_all = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-main"
          + "Project"     = "GHESTDev"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_nat_gateway.self[0] will be created
  + resource "aws_nat_gateway" "self" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-nat-gateway-us-east-1a"
          + "Project"     = "GHESTDev"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-nat-gateway-us-east-1a"
          + "Project"     = "GHESTDev"
        }
    }

  # module.network.aws_nat_gateway.self[1] will be created
  + resource "aws_nat_gateway" "self" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-nat-gateway-us-east-1b"
          + "Project"     = "GHESTDev"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-nat-gateway-us-east-1b"
          + "Project"     = "GHESTDev"
        }
    }

  # module.network.aws_nat_gateway.self[2] will be created
  + resource "aws_nat_gateway" "self" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-nat-gateway-us-east-1c"
          + "Project"     = "GHESTDev"
        }
      + tags_all             = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-nat-gateway-us-east-1c"
          + "Project"     = "GHESTDev"
        }
    }

  # module.network.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-private-routes"
          + "Project"     = "GHESTDev"
        }
      + tags_all         = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-private-routes"
          + "Project"     = "GHESTDev"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-private-routes"
          + "Project"     = "GHESTDev"
        }
      + tags_all         = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-private-routes"
          + "Project"     = "GHESTDev"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-private-routes"
          + "Project"     = "GHESTDev"
        }
      + tags_all         = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-private-routes"
          + "Project"     = "GHESTDev"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_security_group.self will be created
  + resource "aws_security_group" "self" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.27.0.0/21",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-firewall"
          + "Project"     = "GHESTDev"
        }
      + tags_all               = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev-firewall"
          + "Project"     = "GHESTDev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.27.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-private-subnet-us-east-1a"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-private-subnet-us-east-1a"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.27.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-private-subnet-us-east-1b"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-private-subnet-us-east-1b"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.27.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-private-subnet-us-east-1c"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-private-subnet-us-east-1c"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.27.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-public-subnet-us-east-1a"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/elb"          = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-public-subnet-us-east-1a"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/elb"          = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.27.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-public-subnet-us-east-1b"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/elb"          = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-public-subnet-us-east-1b"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/elb"          = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.27.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-public-subnet-us-east-1c"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/elb"          = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "Development"
          + "Name"                            = "ghest-dev-public-subnet-us-east-1c"
          + "Project"                         = "GHESTDev"
          + "kubernetes.io/cluster/ghest-dev" = "shared"
          + "kubernetes.io/role/elb"          = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.self will be created
  + resource "aws_vpc" "self" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.27.0.0/21"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev"
          + "Project"     = "GHESTDev"
        }
      + tags_all                             = {
          + "Environment" = "Development"
          + "Name"        = "ghest-dev"
          + "Project"     = "GHESTDev"
        }
    }

Plan: 41 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.eks.data.aws_iam_policy_document.alb will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "alb" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRoleWithWebIdentity",%0A            ]%0A          + effect  = "Allow"%0A%0A          + condition {%0A              + test     = "StringEquals"%0A              + values   = [%0A                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",%0A                ]%0A              + variable = (known after apply)%0A            }%0A%0A          + principals {%0A              + identifiers = [%0A                  + (known after apply),%0A                ]%0A              + type        = "Federated"%0A            }%0A        }%0A    }%0A%0A  # module.eks.data.aws_iam_policy_document.autoscaler will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "autoscaler" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRoleWithWebIdentity",%0A            ]%0A          + effect  = "Allow"%0A%0A          + condition {%0A              + test     = "StringEquals"%0A              + values   = [%0A                  + "system:serviceaccount:kube-system:cluster-autoscaler",%0A                ]%0A              + variable = (known after apply)%0A            }%0A%0A          + principals {%0A              + identifiers = [%0A                  + (known after apply),%0A                ]%0A              + type        = "Federated"%0A            }%0A        }%0A    }%0A%0A  # module.eks.data.aws_subnet.private will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = (known after apply)%0A      + availability_zone                              = (known after apply)%0A      + availability_zone_id                           = (known after apply)%0A      + available_ip_address_count                     = (known after apply)%0A      + cidr_block                                     = (known after apply)%0A      + customer_owned_ipv4_pool                       = (known after apply)%0A      + default_for_az                                 = (known after apply)%0A      + enable_dns64                                   = (known after apply)%0A      + enable_resource_name_dns_a_record_on_launch    = (known after apply)%0A      + enable_resource_name_dns_aaaa_record_on_launch = (known after apply)%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block                                = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = (known after apply)%0A      + map_customer_owned_ip_on_launch                = (known after apply)%0A      + map_public_ip_on_launch                        = (known after apply)%0A      + outpost_arn                                    = (known after apply)%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + state                                          = (known after apply)%0A      + tags                                           = (known after apply)%0A      + vpc_id                                         = (known after apply)%0A%0A      + timeouts {%0A          + read = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.data.tls_certificate.self will be read during apply%0A  # (config refers to values not yet known)%0A <= data "tls_certificate" "self" {%0A      + certificates = (known after apply)%0A      + id           = (known after apply)%0A      + url          = (known after apply)%0A    }%0A%0A  # module.eks.aws_eks_cluster.self will be created%0A  + resource "aws_eks_cluster" "self" {%0A      + arn                   = (known after apply)%0A      + certificate_authority = (known after apply)%0A      + created_at            = (known after apply)%0A      + endpoint              = (known after apply)%0A      + id                    = (known after apply)%0A      + identity              = (known after apply)%0A      + name                  = "ghest-dev"%0A      + platform_version      = (known after apply)%0A      + role_arn              = (known after apply)%0A      + status                = (known after apply)%0A      + tags                  = {%0A          + "Environment" = "Development"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all              = {%0A          + "Environment" = "Development"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + version               = (known after apply)%0A%0A      + kubernetes_network_config {%0A          + ip_family         = (known after apply)%0A          + service_ipv4_cidr = (known after apply)%0A        }%0A%0A      + vpc_config {%0A          + cluster_security_group_id = (known after apply)%0A          + endpoint_private_access   = true%0A          + endpoint_public_access    = false%0A          + public_access_cidrs       = (known after apply)%0A          + subnet_ids                = (known after apply)%0A          + vpc_id                    = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.aws_eks_node_group.self[0] will be created%0A  + resource "aws_eks_node_group" "self" {%0A      + ami_type               = (known after apply)%0A      + arn                    = (known after apply)%0A      + capacity_type          = "ON_DEMAND"%0A      + cluster_name           = "ghest-dev"%0A      + disk_size              = 100%0A      + id                     = (known after apply)%0A      + instance_types         = [%0A          + "t3.large",%0A        ]%0A      + node_group_name        = "ghest-dev-workers"%0A      + node_group_name_prefix = (known after apply)%0A      + node_role_arn          = (known after apply)%0A      + release_version        = (known after apply)%0A      + resources              = (known after apply)%0A      + status                 = (known after apply)%0A      + subnet_ids             = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version                = (known after apply)%0A%0A      + scaling_config {%0A          + desired_size = 3%0A          + max_size     = (known after apply)%0A          + min_size     = 3%0A        }%0A%0A      + update_config {%0A          + max_unavailable = 1%0A        }%0A    }%0A%0A  # module.eks.aws_iam_openid_connect_provider.self will be created%0A  + resource "aws_iam_openid_connect_provider" "self" {%0A      + arn             = (known after apply)%0A      + client_id_list  = [%0A          + "sts.amazonaws.com",%0A        ]%0A      + id              = (known after apply)%0A      + tags_all        = (known after apply)%0A      + thumbprint_list = (known after apply)%0A      + url             = (known after apply)%0A    }%0A%0A  # module.eks.aws_iam_policy.alb will be created%0A  + resource "aws_iam_policy" "alb" {%0A      + arn       = (known after apply)%0A      + id        = (known after apply)%0A      + name      = "GHESTDevAWSLoadBalancerControllerIAMPolicy"%0A      + path      = "/"%0A      + policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "iam:CreateServiceLinkedRole",%0A                        ]%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ec2:DescribeAccountAttributes",%0A                          + "ec2:DescribeAddresses",%0A                          + "ec2:DescribeAvailabilityZones",%0A                          + "ec2:DescribeInternetGateways",%0A                          + "ec2:DescribeVpcs",%0A                          + "ec2:DescribeVpcPeeringConnections",%0A                          + "ec2:DescribeSubnets",%0A                          + "ec2:DescribeSecurityGroups",%0A                          + "ec2:DescribeInstances",%0A                          + "ec2:DescribeNetworkInterfaces",%0A                          + "ec2:DescribeTags",%0A                          + "ec2:GetCoipPoolUsage",%0A                          + "ec2:DescribeCoipPools",%0A                          + "elasticloadbalancing:DescribeLoadBalancers",%0A                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",%0A                          + "elasticloadbalancing:DescribeListeners",%0A                          + "elasticloadbalancing:DescribeListenerCertificates",%0A                          + "elasticloadbalancing:DescribeSSLPolicies",%0A                          + "elasticloadbalancing:DescribeRules",%0A                          + "elasticloadbalancing:DescribeTargetGroups",%0A                          + "elasticloadbalancing:DescribeTargetGroupAttributes",%0A                          + "elasticloadbalancing:DescribeTargetHealth",%0A                          + "elasticloadbalancing:DescribeTags",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "cognito-idp:DescribeUserPoolClient",%0A                          + "acm:ListCertificates",%0A                          + "acm:DescribeCertificate",%0A                          + "iam:ListServerCertificates",%0A                          + "iam:GetServerCertificate",%0A                          + "waf-regional:GetWebACL",%0A                          + "waf-regional:GetWebACLForResource",%0A                          + "waf-regional:AssociateWebACL",%0A                          + "waf-regional:DisassociateWebACL",%0A                          + "wafv2:GetWebACL",%0A                          + "wafv2:GetWebACLForResource",%0A                          + "wafv2:AssociateWebACL",%0A                          + "wafv2:DisassociateWebACL",%0A                          + "shield:GetSubscriptionState",%0A                          + "shield:DescribeProtection",%0A                          + "shield:CreateProtection",%0A                          + "shield:DeleteProtection",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ec2:AuthorizeSecurityGroupIngress",%0A                          + "ec2:RevokeSecurityGroupIngress",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ec2:CreateSecurityGroup",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "ec2:CreateTags",%0A                        ]%0A                      + Condition = {%0A                          + Null         = {%0A                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                          + StringEquals = {%0A                              + "ec2:CreateAction" = "CreateSecurityGroup"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "arn:aws:ec2:*:*:security-group/*"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "ec2:CreateTags",%0A                          + "ec2:DeleteTags",%0A                        ]%0A                      + Condition = {%0A                          + Null = {%0A                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"%0A                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "arn:aws:ec2:*:*:security-group/*"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "ec2:AuthorizeSecurityGroupIngress",%0A                          + "ec2:RevokeSecurityGroupIngress",%0A                          + "ec2:DeleteSecurityGroup",%0A                        ]%0A                      + Condition = {%0A                          + Null = {%0A                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "*"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "elasticloadbalancing:CreateLoadBalancer",%0A                          + "elasticloadbalancing:CreateTargetGroup",%0A                        ]%0A                      + Condition = {%0A                          + Null = {%0A                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "elasticloadbalancing:CreateListener",%0A                          + "elasticloadbalancing:DeleteListener",%0A                          + "elasticloadbalancing:CreateRule",%0A                          + "elasticloadbalancing:DeleteRule",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "elasticloadbalancing:AddTags",%0A                          + "elasticloadbalancing:RemoveTags",%0A                        ]%0A                      + Condition = {%0A                          + Null = {%0A                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"%0A                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = [%0A                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",%0A                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",%0A                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",%0A                        ]%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "elasticloadbalancing:AddTags",%0A                          + "elasticloadbalancing:RemoveTags",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",%0A                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",%0A                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",%0A                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",%0A                        ]%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",%0A                          + "elasticloadbalancing:SetIpAddressType",%0A                          + "elasticloadbalancing:SetSecurityGroups",%0A                          + "elasticloadbalancing:SetSubnets",%0A                          + "elasticloadbalancing:DeleteLoadBalancer",%0A                          + "elasticloadbalancing:ModifyTargetGroup",%0A                          + "elasticloadbalancing:ModifyTargetGroupAttributes",%0A                          + "elasticloadbalancing:DeleteTargetGroup",%0A                        ]%0A                      + Condition = {%0A                          + Null = {%0A                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "elasticloadbalancing:RegisterTargets",%0A                          + "elasticloadbalancing:DeregisterTargets",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "elasticloadbalancing:SetWebAcl",%0A                          + "elasticloadbalancing:ModifyListener",%0A                          + "elasticloadbalancing:AddListenerCertificates",%0A                          + "elasticloadbalancing:RemoveListenerCertificates",%0A                          + "elasticloadbalancing:ModifyRule",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id = (known after apply)%0A      + tags_all  = (known after apply)%0A    }%0A%0A  # module.eks.aws_iam_policy.autoscaler will be created%0A  + resource "aws_iam_policy" "autoscaler" {%0A      + arn       = (known after apply)%0A      + id        = (known after apply)%0A      + name      = "GHESTDevEKSClusterAutoscalerIAMPolicy"%0A      + path      = "/"%0A      + policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "autoscaling:DescribeAutoScalingInstances",%0A                          + "autoscaling:TerminateInstanceInAutoScalingGroup",%0A                          + "autoscaling:DescribeAutoScalingGroups",%0A                          + "autoscaling:DescribeLaunchConfigurations",%0A                          + "autoscaling:SetDesiredCapacity",%0A                          + "autoscaling:DescribeTags",%0A                          + "ec2:DescribeLaunchTemplateVersions",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id = (known after apply)%0A      + tags_all  = (known after apply)%0A    }%0A%0A  # module.eks.aws_iam_role.alb will be created%0A  + resource "aws_iam_role" "alb" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = (known after apply)%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "GHESTDevALBIngressControllerServiceAccountRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.aws_iam_role.autoscaler will be created%0A  + resource "aws_iam_role" "autoscaler" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = (known after apply)%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "GHESTDevEKSClusterAutoscalerServiceAccountRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.aws_iam_role.eks_cluster_role will be created%0A  + resource "aws_iam_role" "eks_cluster_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "eks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "GHESTDevEKSClusterRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.aws_iam_role.node_group will be created%0A  + resource "aws_iam_role" "node_group" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "GHESTDevManagedNodeGroupRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created%0A  + resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"%0A      + role       = "GHESTDevManagedNodeGroupRole"%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created%0A  + resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"%0A      + role       = "GHESTDevManagedNodeGroupRole"%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created%0A  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"%0A      + role       = "GHESTDevManagedNodeGroupRole"%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.alb will be created%0A  + resource "aws_iam_role_policy_attachment" "alb" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.autoscaler will be created%0A  + resource "aws_iam_role_policy_attachment" "autoscaler" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.eks_cluster_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"%0A      + role       = "GHESTDevEKSClusterRole"%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.eks_service_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "eks_service_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"%0A      + role       = "GHESTDevEKSClusterRole"%0A    }%0A%0A  # module.network.aws_default_route_table.public will be created%0A  + resource "aws_default_route_table" "public" {%0A      + arn                    = (known after apply)%0A      + default_route_table_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + route                  = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags                   = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-public-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all               = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-public-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.network.aws_eip.self[0] will be created%0A  + resource "aws_eip" "self" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = (known after apply)%0A      + vpc                  = true%0A    }%0A%0A  # module.network.aws_eip.self[1] will be created%0A  + resource "aws_eip" "self" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = (known after apply)%0A      + vpc                  = true%0A    }%0A%0A  # module.network.aws_eip.self[2] will be created%0A  + resource "aws_eip" "self" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = (known after apply)%0A      + vpc                  = true%0A    }%0A%0A  # module.network.aws_internet_gateway.self will be created%0A  + resource "aws_internet_gateway" "self" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-main"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-main"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.network.aws_nat_gateway.self[0] will be created%0A  + resource "aws_nat_gateway" "self" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1a"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1a"%0A          + "Project"     = "GHESTDev"%0A        }%0A    }%0A%0A  # module.network.aws_nat_gateway.self[1] will be created%0A  + resource "aws_nat_gateway" "self" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1b"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1b"%0A          + "Project"     = "GHESTDev"%0A        }%0A    }%0A%0A  # module.network.aws_nat_gateway.self[2] will be created%0A  + resource "aws_nat_gateway" "self" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1c"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1c"%0A          + "Project"     = "GHESTDev"%0A        }%0A    }%0A%0A  # module.network.aws_route_table.private[0] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table.private[1] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table.private[2] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.private[2] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.public[2] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_security_group.self will be created%0A  + resource "aws_security_group" "self" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "172.27.0.0/21",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-firewall"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all               = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-firewall"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.0.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1a"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1a"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1b"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1b"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.private[2] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1c"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1c"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1a"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1a"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1b"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1b"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.public[2] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1c"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1c"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_vpc.self will be created%0A  + resource "aws_vpc" "self" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "172.27.0.0/21"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all                             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev"%0A          + "Project"     = "GHESTDev"%0A        }%0A    }%0A%0APlan: 41 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.eks.data.aws_iam_policy_document.alb will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "alb" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRoleWithWebIdentity",%0A            ]%0A          + effect  = "Allow"%0A%0A          + condition {%0A              + test     = "StringEquals"%0A              + values   = [%0A                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",%0A                ]%0A              + variable = (known after apply)%0A            }%0A%0A          + principals {%0A              + identifiers = [%0A                  + (known after apply),%0A                ]%0A              + type        = "Federated"%0A            }%0A        }%0A    }%0A%0A  # module.eks.data.aws_iam_policy_document.autoscaler will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "autoscaler" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRoleWithWebIdentity",%0A            ]%0A          + effect  = "Allow"%0A%0A          + condition {%0A              + test     = "StringEquals"%0A              + values   = [%0A                  + "system:serviceaccount:kube-system:cluster-autoscaler",%0A                ]%0A              + variable = (known after apply)%0A            }%0A%0A          + principals {%0A              + identifiers = [%0A                  + (known after apply),%0A                ]%0A              + type        = "Federated"%0A            }%0A        }%0A    }%0A%0A  # module.eks.data.aws_subnet.private will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = (known after apply)%0A      + availability_zone                              = (known after apply)%0A      + availability_zone_id                           = (known after apply)%0A      + available_ip_address_count                     = (known after apply)%0A      + cidr_block                                     = (known after apply)%0A      + customer_owned_ipv4_pool                       = (known after apply)%0A      + default_for_az                                 = (known after apply)%0A      + enable_dns64                                   = (known after apply)%0A      + enable_resource_name_dns_a_record_on_launch    = (known after apply)%0A      + enable_resource_name_dns_aaaa_record_on_launch = (known after apply)%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block                                = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = (known after apply)%0A      + map_customer_owned_ip_on_launch                = (known after apply)%0A      + map_public_ip_on_launch                        = (known after apply)%0A      + outpost_arn                                    = (known after apply)%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + state                                          = (known after apply)%0A      + tags                                           = (known after apply)%0A      + vpc_id                                         = (known after apply)%0A%0A      + timeouts {%0A          + read = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.data.tls_certificate.self will be read during apply%0A  # (config refers to values not yet known)%0A <= data "tls_certificate" "self" {%0A      + certificates = (known after apply)%0A      + id           = (known after apply)%0A      + url          = (known after apply)%0A    }%0A%0A  # module.eks.aws_eks_cluster.self will be created%0A  + resource "aws_eks_cluster" "self" {%0A      + arn                   = (known after apply)%0A      + certificate_authority = (known after apply)%0A      + created_at            = (known after apply)%0A      + endpoint              = (known after apply)%0A      + id                    = (known after apply)%0A      + identity              = (known after apply)%0A      + name                  = "ghest-dev"%0A      + platform_version      = (known after apply)%0A      + role_arn              = (known after apply)%0A      + status                = (known after apply)%0A      + tags                  = {%0A          + "Environment" = "Development"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all              = {%0A          + "Environment" = "Development"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + version               = (known after apply)%0A%0A      + kubernetes_network_config {%0A          + ip_family         = (known after apply)%0A          + service_ipv4_cidr = (known after apply)%0A        }%0A%0A      + vpc_config {%0A          + cluster_security_group_id = (known after apply)%0A          + endpoint_private_access   = true%0A          + endpoint_public_access    = false%0A          + public_access_cidrs       = (known after apply)%0A          + subnet_ids                = (known after apply)%0A          + vpc_id                    = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.aws_eks_node_group.self[0] will be created%0A  + resource "aws_eks_node_group" "self" {%0A      + ami_type               = (known after apply)%0A      + arn                    = (known after apply)%0A      + capacity_type          = "ON_DEMAND"%0A      + cluster_name           = "ghest-dev"%0A      + disk_size              = 100%0A      + id                     = (known after apply)%0A      + instance_types         = [%0A          + "t3.large",%0A        ]%0A      + node_group_name        = "ghest-dev-workers"%0A      + node_group_name_prefix = (known after apply)%0A      + node_role_arn          = (known after apply)%0A      + release_version        = (known after apply)%0A      + resources              = (known after apply)%0A      + status                 = (known after apply)%0A      + subnet_ids             = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version                = (known after apply)%0A%0A      + scaling_config {%0A          + desired_size = 3%0A          + max_size     = (known after apply)%0A          + min_size     = 3%0A        }%0A%0A      + update_config {%0A          + max_unavailable = 1%0A        }%0A    }%0A%0A  # module.eks.aws_iam_openid_connect_provider.self will be created%0A  + resource "aws_iam_openid_connect_provider" "self" {%0A      + arn             = (known after apply)%0A      + client_id_list  = [%0A          + "sts.amazonaws.com",%0A        ]%0A      + id              = (known after apply)%0A      + tags_all        = (known after apply)%0A      + thumbprint_list = (known after apply)%0A      + url             = (known after apply)%0A    }%0A%0A  # module.eks.aws_iam_policy.alb will be created%0A  + resource "aws_iam_policy" "alb" {%0A      + arn       = (known after apply)%0A      + id        = (known after apply)%0A      + name      = "GHESTDevAWSLoadBalancerControllerIAMPolicy"%0A      + path      = "/"%0A      + policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "iam:CreateServiceLinkedRole",%0A                        ]%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ec2:DescribeAccountAttributes",%0A                          + "ec2:DescribeAddresses",%0A                          + "ec2:DescribeAvailabilityZones",%0A                          + "ec2:DescribeInternetGateways",%0A                          + "ec2:DescribeVpcs",%0A                          + "ec2:DescribeVpcPeeringConnections",%0A                          + "ec2:DescribeSubnets",%0A                          + "ec2:DescribeSecurityGroups",%0A                          + "ec2:DescribeInstances",%0A                          + "ec2:DescribeNetworkInterfaces",%0A                          + "ec2:DescribeTags",%0A                          + "ec2:GetCoipPoolUsage",%0A                          + "ec2:DescribeCoipPools",%0A                          + "elasticloadbalancing:DescribeLoadBalancers",%0A                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",%0A                          + "elasticloadbalancing:DescribeListeners",%0A                          + "elasticloadbalancing:DescribeListenerCertificates",%0A                          + "elasticloadbalancing:DescribeSSLPolicies",%0A                          + "elasticloadbalancing:DescribeRules",%0A                          + "elasticloadbalancing:DescribeTargetGroups",%0A                          + "elasticloadbalancing:DescribeTargetGroupAttributes",%0A                          + "elasticloadbalancing:DescribeTargetHealth",%0A                          + "elasticloadbalancing:DescribeTags",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "cognito-idp:DescribeUserPoolClient",%0A                          + "acm:ListCertificates",%0A                          + "acm:DescribeCertificate",%0A                          + "iam:ListServerCertificates",%0A                          + "iam:GetServerCertificate",%0A                          + "waf-regional:GetWebACL",%0A                          + "waf-regional:GetWebACLForResource",%0A                          + "waf-regional:AssociateWebACL",%0A                          + "waf-regional:DisassociateWebACL",%0A                          + "wafv2:GetWebACL",%0A                          + "wafv2:GetWebACLForResource",%0A                          + "wafv2:AssociateWebACL",%0A                          + "wafv2:DisassociateWebACL",%0A                          + "shield:GetSubscriptionState",%0A                          + "shield:DescribeProtection",%0A                          + "shield:CreateProtection",%0A                          + "shield:DeleteProtection",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ec2:AuthorizeSecurityGroupIngress",%0A                          + "ec2:RevokeSecurityGroupIngress",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ec2:CreateSecurityGroup",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "ec2:CreateTags",%0A                        ]%0A                      + Condition = {%0A                          + Null         = {%0A                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                          + StringEquals = {%0A                              + "ec2:CreateAction" = "CreateSecurityGroup"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "arn:aws:ec2:*:*:security-group/*"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "ec2:CreateTags",%0A                          + "ec2:DeleteTags",%0A                        ]%0A                      + Condition = {%0A                          + Null = {%0A                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"%0A                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "arn:aws:ec2:*:*:security-group/*"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "ec2:AuthorizeSecurityGroupIngress",%0A                          + "ec2:RevokeSecurityGroupIngress",%0A                          + "ec2:DeleteSecurityGroup",%0A                        ]%0A                      + Condition = {%0A                          + Null = {%0A                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "*"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "elasticloadbalancing:CreateLoadBalancer",%0A                          + "elasticloadbalancing:CreateTargetGroup",%0A                        ]%0A                      + Condition = {%0A                          + Null = {%0A                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "elasticloadbalancing:CreateListener",%0A                          + "elasticloadbalancing:DeleteListener",%0A                          + "elasticloadbalancing:CreateRule",%0A                          + "elasticloadbalancing:DeleteRule",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "elasticloadbalancing:AddTags",%0A                          + "elasticloadbalancing:RemoveTags",%0A                        ]%0A                      + Condition = {%0A                          + Null = {%0A                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"%0A                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = [%0A                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",%0A                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",%0A                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",%0A                        ]%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "elasticloadbalancing:AddTags",%0A                          + "elasticloadbalancing:RemoveTags",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",%0A                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",%0A                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",%0A                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",%0A                        ]%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",%0A                          + "elasticloadbalancing:SetIpAddressType",%0A                          + "elasticloadbalancing:SetSecurityGroups",%0A                          + "elasticloadbalancing:SetSubnets",%0A                          + "elasticloadbalancing:DeleteLoadBalancer",%0A                          + "elasticloadbalancing:ModifyTargetGroup",%0A                          + "elasticloadbalancing:ModifyTargetGroupAttributes",%0A                          + "elasticloadbalancing:DeleteTargetGroup",%0A                        ]%0A                      + Condition = {%0A                          + Null = {%0A                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Resource  = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "elasticloadbalancing:RegisterTargets",%0A                          + "elasticloadbalancing:DeregisterTargets",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "elasticloadbalancing:SetWebAcl",%0A                          + "elasticloadbalancing:ModifyListener",%0A                          + "elasticloadbalancing:AddListenerCertificates",%0A                          + "elasticloadbalancing:RemoveListenerCertificates",%0A                          + "elasticloadbalancing:ModifyRule",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id = (known after apply)%0A      + tags_all  = (known after apply)%0A    }%0A%0A  # module.eks.aws_iam_policy.autoscaler will be created%0A  + resource "aws_iam_policy" "autoscaler" {%0A      + arn       = (known after apply)%0A      + id        = (known after apply)%0A      + name      = "GHESTDevEKSClusterAutoscalerIAMPolicy"%0A      + path      = "/"%0A      + policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "autoscaling:DescribeAutoScalingInstances",%0A                          + "autoscaling:TerminateInstanceInAutoScalingGroup",%0A                          + "autoscaling:DescribeAutoScalingGroups",%0A                          + "autoscaling:DescribeLaunchConfigurations",%0A                          + "autoscaling:SetDesiredCapacity",%0A                          + "autoscaling:DescribeTags",%0A                          + "ec2:DescribeLaunchTemplateVersions",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id = (known after apply)%0A      + tags_all  = (known after apply)%0A    }%0A%0A  # module.eks.aws_iam_role.alb will be created%0A  + resource "aws_iam_role" "alb" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = (known after apply)%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "GHESTDevALBIngressControllerServiceAccountRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.aws_iam_role.autoscaler will be created%0A  + resource "aws_iam_role" "autoscaler" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = (known after apply)%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "GHESTDevEKSClusterAutoscalerServiceAccountRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.aws_iam_role.eks_cluster_role will be created%0A  + resource "aws_iam_role" "eks_cluster_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "eks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "GHESTDevEKSClusterRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.aws_iam_role.node_group will be created%0A  + resource "aws_iam_role" "node_group" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "GHESTDevManagedNodeGroupRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created%0A  + resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"%0A      + role       = "GHESTDevManagedNodeGroupRole"%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created%0A  + resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"%0A      + role       = "GHESTDevManagedNodeGroupRole"%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created%0A  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"%0A      + role       = "GHESTDevManagedNodeGroupRole"%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.alb will be created%0A  + resource "aws_iam_role_policy_attachment" "alb" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.autoscaler will be created%0A  + resource "aws_iam_role_policy_attachment" "autoscaler" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.eks_cluster_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"%0A      + role       = "GHESTDevEKSClusterRole"%0A    }%0A%0A  # module.eks.aws_iam_role_policy_attachment.eks_service_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "eks_service_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"%0A      + role       = "GHESTDevEKSClusterRole"%0A    }%0A%0A  # module.network.aws_default_route_table.public will be created%0A  + resource "aws_default_route_table" "public" {%0A      + arn                    = (known after apply)%0A      + default_route_table_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + route                  = [%0A          + {%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags                   = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-public-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all               = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-public-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.network.aws_eip.self[0] will be created%0A  + resource "aws_eip" "self" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = (known after apply)%0A      + vpc                  = true%0A    }%0A%0A  # module.network.aws_eip.self[1] will be created%0A  + resource "aws_eip" "self" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = (known after apply)%0A      + vpc                  = true%0A    }%0A%0A  # module.network.aws_eip.self[2] will be created%0A  + resource "aws_eip" "self" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = (known after apply)%0A      + vpc                  = true%0A    }%0A%0A  # module.network.aws_internet_gateway.self will be created%0A  + resource "aws_internet_gateway" "self" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-main"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-main"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.network.aws_nat_gateway.self[0] will be created%0A  + resource "aws_nat_gateway" "self" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1a"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1a"%0A          + "Project"     = "GHESTDev"%0A        }%0A    }%0A%0A  # module.network.aws_nat_gateway.self[1] will be created%0A  + resource "aws_nat_gateway" "self" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1b"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1b"%0A          + "Project"     = "GHESTDev"%0A        }%0A    }%0A%0A  # module.network.aws_nat_gateway.self[2] will be created%0A  + resource "aws_nat_gateway" "self" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1c"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-nat-gateway-us-east-1c"%0A          + "Project"     = "GHESTDev"%0A        }%0A    }%0A%0A  # module.network.aws_route_table.private[0] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table.private[1] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table.private[2] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-private-routes"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.private[2] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_route_table_association.public[2] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.network.aws_security_group.self will be created%0A  + resource "aws_security_group" "self" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "172.27.0.0/21",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-firewall"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all               = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev-firewall"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.0.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1a"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1a"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1b"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1b"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.private[2] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1c"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-private-subnet-us-east-1c"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/internal-elb" = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1a"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1a"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1b"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1b"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_subnet.public[2] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "172.27.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1c"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + tags_all                                       = {%0A          + "Environment"                     = "Development"%0A          + "Name"                            = "ghest-dev-public-subnet-us-east-1c"%0A          + "Project"                         = "GHESTDev"%0A          + "kubernetes.io/cluster/ghest-dev" = "shared"%0A          + "kubernetes.io/role/elb"          = "1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.network.aws_vpc.self will be created%0A  + resource "aws_vpc" "self" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "172.27.0.0/21"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev"%0A          + "Project"     = "GHESTDev"%0A        }%0A      + tags_all                             = {%0A          + "Environment" = "Development"%0A          + "Name"        = "ghest-dev"%0A          + "Project"     = "GHESTDev"%0A        }%0A    }%0A%0APlan: 41 to add, 0 to change, 0 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0
``` \n </details>
